In [22]:
import pandas as pd

# Task a data frame , save it as csvfile and set index a name

In [23]:
data =["Tom","Nick","Mick","Joe","Alex","Mark", "Tim"]
num =[12,23,16,18,19,21,11]

data = {'Name':data,'Age':num}
print(data)
df = pd.DataFrame(data)
df

{'Name': ['Tom', 'Nick', 'Mick', 'Joe', 'Alex', 'Mark', 'Tim'], 'Age': [12, 23, 16, 18, 19, 21, 11]}

   Name  Age
0   Tom   12
1  Nick   23
2  Mick   16
3   Joe   18
4  Alex   19
5  Mark   21
6   Tim   11

In [24]:
#saving to csv file
df.to_csv('pandasfile.csv')

In [29]:
#set index name
df.set_index('Name',inplace = True)
df

      Age
Name
Tom    12
Nick   23
Mick   16
Joe    18
Alex   19
Mark   21
Tim    11

# Task : create a data frame and merge it with new column

In [34]:
dict1 = {
    "Name" :["Tom","Nick","Mick","Joe"],
    "percentage" : [75,82,69,77]
}

df1 = pd.DataFrame(dict1)
df1

   Name  percentage
0   Tom          75
1  Nick          82
2  Mick          69
3   Joe          77

In [36]:
dict2 = {
    "Name" : ["Alex","Mark", "Tim"],
    "Attendance" : [88,79,85]
}

df2 = pd.DataFrame(dict2)
df2

   Name  Attendance
0  Alex          88
1  Mark          79
2   Tim          85

In [37]:
pd.merge(df1,df2, on='Name', how ='outer')

   Name  percentage  Attendance
0   Tom        75.0         NaN
1  Nick        82.0         NaN
2  Mick        69.0         NaN
3   Joe        77.0         NaN
4  Alex         NaN        88.0
5  Mark         NaN        79.0
6   Tim         NaN        85.0